<?php

return $errorCode = [
    "010000" => "发票请求接收成功",
    "010001" => "发票开具请求数据错误，订单请求批次号已存在",
    "010002" => "发票开具请求数据错误，订单请求流水号已存在",
    "010003" => "发票开具请求数据错误，订单批次号和流水号已存在",
    "107003" => [
        "批次信息中订单请求批次号不能为空！",
        "批次信息中订单请求批次号获取长度异常！",
        "批次信息中订单请求批次号数据不合法，长度应大于 1 小于 40！",
        "批次信息中订单请求批次号数据不合法存在特殊字符！"
    ],
    "107005" => [
        "批次信息中纳税人识别号不能为空！",
        "批次信息中纳税人识别号获取长度异常！",
        "批次信息中纳税人识别号数据不合法，长度应大于 15 小于 20！",
        "批次信息中纳税人识别号数据不合法存在特殊字符！",
    ],
    "107006" => "批次信息中纳税人识别号长度只有 15 位，17 位，18 位，20 位，其他长度不合法",
    "107163" => "纳税人识别号需要全部大写",
    "107007" => [
        "批次信息中受理点 ID 获取长度异常！",
        "批次信息中受理点 ID 数据不合法，长度应小于 8！",
        "批次信息中受理点 ID 数据不合法存在特殊字符！",
    ],
    "107009" => [
        "批次信息中开票机号获取长度异常！",
        "批次信息中开票机号数据不合法，长度应小于 20！",
        "批次信息中开票机号数据不合法存在特殊字符！"
    ],
    "107010" => [
        "批次信息中发票类型不能为空！",
        "批次信息中发票类型获取长度异常！",
        "批次信息中发票类型数据不合法，长度应等于 1！",
        "批次信息中发票类型数据不合法存在特殊字符！"
    ],
    "107011" => "发票类型暂时只支持 1：纸质发票，2:电子发票",
    "107012" => [
        "批次信息中发票类别不能为空！",
        "批次信息中发票类别获取长度异常！",
        "批次信息中发票类别数据不合法，长度应大于 1 小于 2！",
        "批次信息中发票类别数据不合法存在特殊字符！",
    ],
    "107013" => "发票类型为 1 时：发票类别只能为 0：专票 2：普票 41：卷票，发票类型为 2 时：发票类别只能为 51：电子票",
    "202004" => "批量订单请求数据为空",
    "107014" => [
        "订单主体信息中订单请求唯一流水号不能为空！",
        "订单主体信息中订单请求唯一流水号获取长度异常！",
        "订单主体信息中订单请求唯一流水号数据不合法，长度应大于 1 小于 40！",
        "订单主体信息中订单请求唯一流水号数据不合法存在特殊字符！"
    ],
    "107016" => [
        "订单主体信息中纳税人识别号不能为空！",
        "订单主体信息中纳税人识别号获取长度异常！",
        "订单主体信息中纳税人识别号数据不合法，长度应大于 15 小于 20！",
        "订单主体信息中纳税人识别号数据不合法存在特殊字符！"
    ],
    "107017" => "订单主体信息中纳税人识别号长度只有 15 位，17 位，18 位，20 位，其他长度不合法",
    "107018" => [
        "订单主体信息中纳税人名称不能为空！",
        "订单主体信息中纳税人名称获取长度异常！",
        "订单主体信息中纳税人名称数据不合法，长度应大于 1 小于 100！",
        "订单主体信息中纳税人名称数据不合法存在特殊字符！"
    ],
    "107020" => [
        "订单主体信息中开票类型不能为空！",
        "订单主体信息中开票类型获取长度异常！",
        "订单主体信息中开票类型数据不合法，长度应等于 1！",
        "订单主体信息中开票类型数据不合法存在特殊字符！"
    ],
    "107021" => "开票类型只能为 0 和 1：0 蓝字发票；1 红字发票",
    "107022" => [
        "订单主体信息中销货方纳税人识别号不能为空！",
        "订单主体信息中销货方纳税人识别号获取长度异常！",
        "订单主体信息中销货方纳税人识别号数据不合法，长度应大于 15 小于 20！",
        "订单主体信息中销货方纳税人识别号数据不合法存在特殊字符！"
    ],
    "107023" => "订单主体信息中购货方纳税人识别号需要全部大写",
    "107024" => [
        "订单主体信息中销货方名称不能为空！",
        "订单主体信息中销货方名称获取长度异常！",
        "订单主体信息中销货方名称数据不合法，长度应大于 1 小于 100！",
        "订单主体信息中销货方名称数据不合法存在特殊字符！"
    ],
    "107025" => "订单主体信息中购货方纳税人识别号长度只有 15 位，17 位，18 位，20 位，其他长度不合法",
    "107026" => [
        "订单主体信息中销货方地址不能为空！",
        "订单主体信息中销货方地址获取长度异常！",
        "订单主体信息中销货方地址数据不合法，长度应大于 1 小于 80！",
        "订单主体信息中销货方地址数据不合法存在特殊字符！"
    ],
    "107027" => [
        "订单主体信息中购货方识别号不能为空！",
        "订单主体信息中购货方识别号获取长度异常！",
        "订单主体信息中购货方识别号数据不合法，长度应大于 1 小于 15！",
        "订单主体信息中购货方识别号数据不合法存在特殊字符！"
    ],
    "107028" => [
        "订单主体信息中销货方电话不能为空！",
        "订单主体信息中销货方电话获取长度异常！",
        "订单主体信息中销货方电话数据不合法，长度应大于 1 小于 20！",
        "订单主体信息中销货方电话数据不合法存在特殊字符！"
    ],
    "107029" => [
        "订单主体信息中销货方银行名称获取长度异常！",
        "订单主体信息中销货方银行名称数据不合法，长度应小于 100！",
        "订单主体信息中销货方银行名称数据不合法存在特殊字符！"
    ],
    "107030" => [
        "订单主体信息中销货方银行银行账户获取长度异常！",
        "订单主体信息中销货方银行银行账户数据不合法，长度应小于 30！",
        "订单主体信息中销货方银行银行账户数据不合法存在特殊字符！"
    ],
    "107031" => [
        "订单主体信息中购货方识别号获取长度异常！",
        "订单主体信息中购货方识别号数据不合法，长度应大于 15 小于 20！",
        "订单主体信息中购货方识别号数据不合法存在特殊字符！"
    ],
    "107032" => [
        "订单主体信息中购货方名称不能为空！",
        "订单主体信息中购货方名称获取长度异常！",
        "订单主体信息中购货方名称数据不合法，长度应大于 1 小于 100！",
        "订单主体信息中购货方名称数据不合法存在特殊字符！"
    ],
    "107034" => [
        "订单主体信息中购货方地址获取长度异常！",
        "订单主体信息中购货方地址数据不合法，长度应小于 80！",
        "订单主体信息中购货方地址数据不合法存在特殊字符！"
    ],
    "107035" => [
        "订单主体信息中购买方企业类型不能为空！",
        "订单主体信息中购买方企业类型获取长度异常！",
        "订单主体信息中购买方企业类型数据不合法，长度应等于 2！",
        "订单主体信息中购买方企业类型数据不合法存在特殊字符！"
    ],
    "107036" => "订单主体信息中购买方企业类型只能为:01 企业，02 机关事业单位，03 个人，04 其他",
    "107037" => [
        "订单主体信息中购买方省份获取长度异常！",
        "订单主体信息中购买方省份数据不合法，长度应小于 20！",
        "订单主体信息中购买方省份数据不合法存在特殊字符！"
    ],
    "107038" => [
        "订单主体信息中购买方固定电话获取长度异常！",
        "订单主体信息中购买方固定电话数据不合法，长度应小于 20！",
        "订单主体信息中购买方固定电话数据不合法存在特殊字符！"
    ],
    "107040" => [
        "订单主体信息中购买方手机获取长度异常！",
        "订单主体信息中购买方手机数据不合法，长度应小于 20！",
        "订单主体信息中购买方手机数据不合法存在特殊字符！"
    ],
    "107042" => [
        "订单主体信息中购买方邮箱获取长度异常！",
        "订单主体信息中购买方邮箱数据不合法，长度应小于 50！",
        "订单主体信息中购买方邮箱数据不合法存在特殊字符！"
    ],
    "107043" => [
        "订单主体信息中购买方银行名称获取长度异常！",
        "订单主体信息中购买方银行名称数据不合法，长度应小于 100！",
        "订单主体信息中购买方银行名称数据不合法存在特殊字符！"
    ],
    "107039" => [
        "订单主体信息中购买方银行帐号获取长度异常！",
        "订单主体信息中购买方银行帐号数据不合法，长度应小于 30！",
        "订单主体信息中购买方银行帐号数据不合法存在特殊字符！"
    ],
    "107044" => [
        "订单主体信息中开票人不能为空！",
        "订单主体信息中开票人获取长度异常！",
        "订单主体信息中开票人数据不合法，长度应大于 1 小于 8！",
        "订单主体信息中开票人数据不合法存在特殊字符！"
    ],
    "107046" => [
        "订单主体信息中收款人获取长度异常！",
        "订单主体信息中收款人数据不合法，长度应小于 8！",
        "订单主体信息中收款人数据不合法存在特殊字符！",
    ],
    "107048" => [
        "订单主体信息中复核人获取长度异常！",
        "订单主体信息中复核人数据不合法，长度应小于 8！",
        "订单主体信息中复核人数据不合法存在特殊字符！"
    ],
    "107049" => [
        "订单主体信息中红票的原发票代码不能为空！",
        "订单主体信息中红票的原发票代码获取长度异常！",
        "订单主体信息中红票的原发票代码数据不合法，长度应大于 10 小于 12！",
        "订单主体信息中红票的原发票代码数据不合法存在特殊字符！"
    ],
    "107050" => [
        "订单主体信息中红票的原发票号码不能为空！",
        "订单主体信息中红票的原发票号码获取长度异常！",
        "订单主体信息中红票的原发票号码数据不合法，长度应等于 8！",
        "订单主体信息中红票的原发票号码数据不合法存在特殊字符！"
    ],
    "107052" => [
        "订单主体信息中冲红原因获取长度异常！",
        "订单主体信息中冲红原因数据不合法，长度应小于 200！",
        "订单主体信息中冲红原因数据不合法存在特殊字符！"
    ],
    "107053" => [
        "订单主体信息中红票特殊冲红标志不能为空！",
        "订单主体信息中红票特殊冲红标志获取长度异常",
        "订单主体信息中红票特殊冲红标志数据不合法，长度应等于 1！",
        "订单主体信息中红票特殊冲红标志数据不合法存在特殊字符！"
    ],
    "107054" => "红票特殊冲红标志只能为 0 和 1：0 为正常冲红，1 为特殊冲红",
    "107055" => [
        "订单明细信息中发票行性质不能为空！",
        "订单明细信息中发票行性质获取长度异常！",
        "订单明细信息中发票行性质数据不合法，长度应等于 1！",
        "订单明细信息中发票行性质数据不合法存在特殊字符！"
    ],
    "107056" => "订单明细信息中发票行性质只能为:0 正常行、1 折扣行、2 被折扣行、6 清单红字发票",
    "107057" => [
        "订单明细信息中项目名称不能为空！",
        "订单明细信息中项目名称获取长度异常！",
        "订单明细信息中项目名称数据不合法，长度应大于 1 小于 90！",
        "订单明细信息中项目名称数据不合法存在特殊字符！"
    ],
    "107058" => [
        "订单明细信息中项目序号获取长度异常！",
        "订单明细信息中项目序号数据不合法，长度应小于 5！",
        "订单明细信息中项目序号数据不合法存在特殊字符！"
    ],
    "107059" => [
        "订单明细信息中规格型号获取长度异常！",
        "订单明细信息中规格型号数据不合法，长度应小于 40！",
        "订单明细信息中规格型号数据不合法存在特殊字符！"
    ],
    "107060" => [
        "订单明细信息中项目单位获取长度异常！",
        "订单明细信息中项目单位数据不合法，长度应小于 20！",
        "订单明细信息中项目单位数据不合法存在特殊字符！"
    ],
    "107062" => "订单明细信息中项目金额须为 2 位小数",
    "107063" => [
        "订单明细信息中自行编码获取长度异常！",
        "订单明细信息中自行编码数据不合法，长度应小于 16！",
        "订单明细信息中自行编码数据不合法存在特殊字符！"
    ],
    "107064" => [
        "订单明细信息中含税标志不能为空！",
        "订单明细信息中含税标志获取长度异常！",
        "订单明细信息中含税标志数据不合法，长度应等于 1！",
        "订单明细信息中含税标志数据不合法存在特殊字符！"
    ],
    "107065" => "订单明细信息中含税标志只能为 0 和 1：0 表示都不含税,1 表示都含税",
    "107066" => "订单主体信息中价税合计不能为 0 且保证小数点后两位小数",
    "107067" => [
        "订单主体信息中订单号不能为空！",
        "订单主体信息中订单号获取长度异常！",
        "订单主体信息中订单号数据不合法，长度应大于 1 小于 20！",
        "订单主体信息中订单号数据不合法存在特殊字符！"
    ],
    "107068" => [
        "订单主体信息中订单时间获取长度异常！",
        "订单主体信息中订单时间数据不合法，长度应等于 30！",
        "订单主体信息中订单时间数据不合法存在特殊字符！"
    ],
    "107069" => [
        "订单主体信息中退货单号获取长度异常！",
        "订单主体信息中退货单号数据不合法，长度应等于 20！",
        "订单主体信息中退货单号数据不合法存在特殊字符！"
    ],
    "107080" => "订单主体信息中蓝票价税合计必须大于 0 且保证小数点后两位小数",
    "107081" => "订单明细信息中项目金额不能为 0",
    "107082" => "发票批次与订单主体信息中的纳税人识别号不一致",
    "107083" => "订单主体信息中红票价税合计必须小于 0",
    "107097" => [
        "订单主体信息中编码表版本号不能为空！",
        "订单主体信息中编码表版本号获取长度异常！",
        "订单主体信息中编码表版本号数据不合法，长度应大于 1 小于 10！",
        "订单主体信息中编码表版本号数据不合法存在特殊字符！"
    ],
    "107098" => [
        "订单主体信息中清单标志不能为空！",
        "订单主体信息中清单标志获取长度异常！",
        "订单主体信息中清单标志数据不合法，长度应等于 1！",
        "订单主体信息中清单标志数据不合法存在特殊字符！"
    ],
    "107099" => "订单主体信息中清单标志为 1 或 3 时,清单发票项目名称不能为空",
    "107100" => [
        "订单明细信息中商品编码获取长度异常！",
        "订单明细信息中商品编码数据不合法，长度应等于 19！",
        "订单明细信息中商品编码数据不合法存在特殊字符！"
    ],
    "107101" => "订单明细信息中商品编码必须为 19 位数字",
    "107102" => "订单明细信息中优惠政策标识只能为 0 或 1,0:不使用,1:使用",
    "107103" => [
        "订单明细信息中优惠政策标识不能为空！",
        "订单明细信息中优惠政策标识获取长度异常！",
        "订单明细信息中优惠政策标识数据不合法，长度应等于 1！",
        "订单明细信息中优惠政策标识数据不合法存在特殊字符！"
    ],
    "107104" => "订单明细信息中优惠政策标识为 1 时,增值税特殊管理不能为空",
    "107105" => [
        "订单明细信息中增值税特殊管理获取长度异常！",
        "订单明细信息中增值税特殊管理数据不合法，长度应小于 50！",
        "订单明细信息中增值税特殊管理数据不合法存在特殊字符！"
    ],
    "107106" => "订单明细信息中优惠政策标识为 0 时,增值税特殊管理须为空",
    "107108" => "订单明细信息中增值税特殊管理内容为'按 5%简易征收',与商品行税率不一致",
    "107109" => "订单明细信息中增值税特殊管理内容为'按 3%简易征收',与商品行税率不一致",
    "107110" => "订单明细信息中增值税特殊管理内容为'简易征收',与商品行税率不一致",
    "107111" => "订单明细信息中增值税特殊管理内容为'按 5%简易征收减按 1.5%计征',与商品行税率不一致",
    "107112" => "订单明细信息中零税率标识非空,  但商品税率不为零;请保持零税率标识与商品税率逻辑一致!",
    "107113" => "订单明细信息中零税率标识为空,  但商品税率为零;请保持零税率标识与商品税率逻辑一致!",
    "107114" => "订单明细信息中零税率标识为 0/1/2,  但增值税特殊管理内容不为'出口零税/免税/不征税';请保持零税率标识与增值税特殊管理逻辑一致!",
    "107117" => "订单明细信息中税率不能为 13%!",
    "107122" => "订单明细信息中成品油项目单位必填且必须为'升'或'吨'!",
    "107124" => [
        "订单主体信息中清单发票项目名称获取长度异常！",
        "订单主体信息中清单发票项目名称数据不合法，长度应小于 180！",
        "订单主体信息中清单发票项目名称数据不合法存在特殊字符！"
    ],
    "107125" => "订单主体信息中清单标志只能为 0:普通发票,1:普通发票（清单）,2:收购发票,3:收购发票（清单）,4:成品油发票",
    "107127" => "专票冲红时备注必填",
    "107128" => [
        "订单主体信息中备注获取长度异常！",
        "订单主体信息中备注数据不合法，长度应小于 180！",
        "订单主体信息中备注数据不合法存在特殊字符！"
    ],
    "107129" => "专票冲红备注不满足格式要求，请核对",
    "107130" => "``单个批次最多支持 9999 张发票开具",
    "107132" => "订单明细信息中 YHZCBS(优惠政策标识)为 1,  且税率为 0,  则 LSLBS 只能根据实际情况选择'0 或 1 或 2'中的一种, 不能选择 3, 且 ZZSTSGL 内容也只能写与 0/1/2 对应的'出口零税/免税/不征税'",
    "107133" => "订单明细信息中税额须为 2 位小数",
    "107134" => [
        "订单明细信息中税额获取长度异常！",
        "订单明细信息中税额数据不合法，长度应小于 25！",
        "订单明细信息中税额数据不合法存在特殊字符！"
    ],
    "107135" => "订单主体信息中合计不含税金额不为 0 时，小数点位数须为 2 位小数",
    "107136" => "订单主体信息中合计税额不为 0 时，小数点位数须为 2 位小数",
    "107138" => "订单明细信息中零税率标识非空时，只允许传 0、1、2、3",
    "107139" => "订单明细信息中含税标志为 0，税额必填",
    "107140" => "订单明细信息中零税率标识为 3（普通零税）, 则:YHZCBS 填 0,ZZSTSGL 填空",
    "107141" => [
        "订单主体信息中价税合计不能为空！",
        "订单主体信息中价税合计获取长度异常！",
        "订单主体信息中价税合计数据不合法，长度应大于 1 小于 25！",
        "订单主体信息中价税合计数据不合法存在特殊字符！"
    ],
    "107142" => [
        "订单主体信息中合计不含税金额不能为空！",
        "订单主体信息中合计不含税金额获取长度异常！",
        "订单主体信息中合计不含税金额数据不合法，长度应大于 1 小于 25！",
        "订单主体信息中合计不含税金额数据不合法存在特殊字符！"
    ],
    "107143" => [
        "订单主体信息中合计税额不能为空！",
        "订单主体信息中合计税额获取长度异常！",
        "订单主体信息中合计税额数据不合法，长度应大于 1 小于 25！",
        "订单主体信息中合计税额数据不合法存在特殊字符！"
    ],
    "107144" => "订单主体信息中项目单价不能为空且不能为 0",
    "107145" => [
        "订单明细信息中项目金额不能为空！",
        "订单明细信息中项目金额获取长度异常！",
        "订单明细信息中项目金额数据不合法，长度应大于 1 小于 25！",
        "订单明细信息中项目金额数据不合法存在特殊字符！"
    ],
    "107146" => "订单明细信息中税率不能为空",
    "107147" => "订单明细信息中清单红字发票明细行数限制为 1 行",
    "107148" => "订单明细信息中发票行性质为 6，发票开票类型需为红字发票",
    "107150" => "订单明细信息中清单红字发票规格型号、计量单位、项目数量、项目单价填充为空",
    "107151" => "订单明细信息中项目数量不能为空且不能为 0",
    "107157" => "订单明细信息中收购发票商品的税率和税额不允许为空，且都必须为 0",
    "107158" => "可开具农产品收购发票的票种：增普票，电子票",
    "107263" => [
        "专票订单主体信息中销货方地址不能为空！",
        "专票订单主体信息中销货方地址获取长度异常！",
        "专票订单主体信息中销货方地址数据不合法，长度应大于 1 小于 100！",
        "专票订单主体信息中销货方地址数据不合法存在特殊字符！"
    ],
    "107165" => [
        "专票订单主体信息中购货方地址不能为空！",
        "专票订单主体信息中购货方地址获取长度异常！",
        "专票订单主体信息中购货方地址数据不合法，长度应大于 1 小于 100！",
        "专票订单主体信息中购货方地址数据不合法存在特殊字符！"
    ],
    "107166" => [
        "订单主体信息中购买方银行名称不能为空！",
        "订单主体信息中购买方银行名称获取长度异常！",
        "订单主体信息中购买方银行名称数据不合法，长度应大于 1 小于 100！",
        "订单主体信息中购买方银行名称数据不合法存在特殊字符！"
    ],
    "107167" => [
        "订单主体信息中销货方地址和电话获取长度异常！",
        "订单主体信息中销货方地址和电话数据不合法，长度应小于 100！",
        "订单主体信息中销货方地址和电话数据不合法存在特殊字符！"
    ],
    "107168" => [
        "订单主体信息中销货方银行名称和帐号获取长度异常",
        "订单主体信息中销货方银行名称和帐号数据不合法，长度应小于 100！",
        "订单主体信息中销货方银行名称和帐号数据不合法存在特殊字符！"
    ],
    "107169" => [
        "订单主体信息中购货方地址和电话获取长度异常！",
        "订单主体信息中购货方地址和电话数据不合法，长度应小于 100",
        "订单主体信息中购货方地址和电话数据不合法存在特殊字符！"
    ],
    "107170" => [
        "订单主体信息中购买方银行名称和帐号获取长度异常！",
        "订单主体信息中购买方银行名称和帐号数据不合法，长度应小于 100！",
        "订单主体信息中购买方银行名称和帐号数据不合法存在特殊字符！"
    ],
    "202008" => "``批量订单请求批次数据为空",
    "009012" => "订单主体信息中合计金额小于等于零",
    "702001" => "暂不支持请求,请求批次号已存在",

    //开票响应
    "020111" => "发票正在开具",
    "020000" => "发票全部开具成功",
    "020001" => "发票部分开具成功",
    "020002" => "发票全部开具失败",
    "204003" => "发票开具结果获取:未查询该批次号的发票信息!",
    "204002" => "发票开具结果获取查询成功:查询到?条信息",
    "104001" => "发票开具结果数据获取，请求对象不能为空",
    "104002" => "发票开具结果数据获取，请求批次号不能为空",
    "104003" => "发票开具结果数据获取，请求批次号长度不匹配",
    "104004" => "发票开具结果数据获取，发票类型不能为空",
    "104005" => "发票开具结果数据获取，发票类型长度不匹配",
    "104006" => "发票开具结果数据获取, 发票类型只能为 1：纸票，暂不支持电子票",
    "204001" => "发票开具结果数据获取，请求批次号不存在",
    "502001" => "数据库查询异常",

    //查询响应
    "000000" => "开票成功",
    "001000" => "订单处理成功",
    "009661" => "订单数据查询传递数据为空",
    "009662" => "订单数据查询传递数据销方税号为空",
    "009663" => "订单数据查询传递数据订单号为空",
    "009664" => "订单数据查询结果为空",
    "009665" => "订单数据查询明细结果为空",
    "009562" => "批次对应的发票数据不存在",
    "009999" => "订单数据查询接口异常",

    //作废响应
    "040000" => "发票全部作废成功",
    "040001" => "发票部分作废成功",
    "040002" => "发票全部作废失败",
    "108001" => "作废请求不能为空",
    "108002" => "作废批次号不能为空",
    "108003" => "发票代码不能为空",
    "108004" => "发票起号不能为空",
    "108005" => "发票止号不能为空",
    "108006" => "作废类型不能为空",
    "108007" => "作废原因不能为空",
    "108008" => "作废批次号长度不能超过 40 位",
    "108009" => "发票代码长度不能超过 12 位",
    "108010" => "发票起号长度必须为 8 位",
    "108011" => "发票止号长度必须为 8 位",
    "108012" => "作废类型长度必须为 1 位",
    "108013" => "作废原因长度不能超过 200 位",
    "108014" => "作废类型不合法，作废类型只能为 1,2",
    "108015" => "空白作废目前暂不支持",
    "108016" => "不允许重复作废",
    "108017" => "不能跨月作废",
    "108018" => "已经冲红的蓝票不允许作废",
    "108019" => "未找到要作废的发票",
    "108021" => "要作废的空白发票已经作废过，不允许重复作废",
    "108022" => "要作废的空白发票已经是一张蓝字发票，不能空白作废",
    "108023" => "要作废的空白发票已经是一张红字发票，不能空白作废",
    "108024" => "空白作废实际上是空白开具，作废批次号不能与已有的订单请求批次号重复",
    "108025" => "想要空白作废的发票代码号码不等于带生成的发票代码号码，无法作废",
    "108026" => "一个批次内空白作废的条数不能超过 1000 条",
    "108027" => "找不到要作废的空白发票对应的受理点信息，即没有受理点分配到了该段发票，无法空白作废",
    "108028" => "要作废的发票代码不是数字",
    "108029" => "要作废的发票起号不是数字",
    "108030" => "要作废的发票止号不是数字",
    "108031" => "要作废的发票起号不能大于止号",
    "208002" => "作废失败，底层返回为空",
    "208003" => "作废失败，受理点 url 为空，或已被暂停",
    "208004" => "作废失败，底层返回错误",
    "208005" => "作废失败，已空白作废成功的这张票不是需要作废的这张票，需要人工干预",
    "701008" => "发票作废未捕获异常",

    //红字发票申请表
    "115001" => "申请表上传请求批次号重复",
    "115002" => "申请表上传请求批次号为空",
    "115003" => "申请表上传请求批次号长度不合法，长度最大为 40 位",
    "115004" => "申请表上传请求流水号为空",
    "115005" => "申请表上传请求流水号长度不合法，长度最大为 43 位",
    "115006" => "申请方纳税人识别号为空",
    "115007" => "申请方纳税人识别号长度有误，最大长度为 20 位",
    "115008" => "开票机号为空",
    "115009" => "开票机号长度有误，最大长度为 20 位",
    "115010" => "发票类型为空",
    "115011" => "发票类型不合法，发票类型只能为 1 或 2",
    "115012" => "发票类别为空",
    "115013" => "发票类别不合法，红字发票申请表上传申请发票类别只能为 0,不能为 1",
    "115014" => "申请类别为空",
    "115015" => "申请类别只能为 0 或 1",
    "115016" => "信息表类型为空",
    "115017" => "信息表类型只能为 0 或 1",
    "115018" => "原发票代码为空",
    "115019" => "原发票代码长度有误，最大长度为 12 位",
    "115020" => "原发票号码为空",
    "115021" => "原发票号码长度有误，最大长度为 8 位",
    "115022" => "原发票开票日期不合法，申请类别为 1 时，日期必填",
    "115023" => "填开时间为空",
    "115024" => "填开时间不合法，格式必须是 YYYYMMDDHHMMSS",
    "115025" => "销售方纳税人识别号不合法，申请类别为 1 时，此项是必填",
    "115026" => "销售方纳税人识别号不符合税务局规则",
    "115027" => "销售方纳税人名称不合法，申请类别为 1 时，此项是必填",
    "115028" => "销售方纳税人名称长度有误，最大长度为 100 位",
    "115029" => "购买方纳税人识别号不合法，申请类别为 1 时，此项是必填",
    "115030" => "购买方纳税人识别号不符合税务局规则",
    "115031" => "购买方纳税人名称不合法，申请类别为 1 时，此项是必填",
    "115032" => "购买方纳税人名称长度有误，最大长度为 100 位",
    "115033" => "合计金额(不含税)不合法，申请类别为 1 时，此项是必填",
    "115034" => "数据关联校验不合法, 明细合计金额不等于合计金",
    "115035" => "合计税额不合法，申请类别为 1 时，此项是必填",
    "115036" => "数据关联校验不合法, 明细合计税额不等于合计税额",
    "115037" => "申请说明为空",
    "115038" => "申请说明填写有误, 请参考规则说明",
    "115039" => "编码表版本号为空",
    "115040" => "编码表版本号长度有误，最大长度为 20 位",
    "115041" => "项目序号有误，请确认",
    "115042" => "发票行性质为空",
    "115043" => "商品编码为空",
    "115044" => "商品编码长度有误，最大长度为 19 位",
    "115045" => "自行编码长度有误，最大长度为 20 位",
    "115046" => "优惠政策标识为空",
    "115047" => "零税率标识不合法，空：非零税率，0:出口零税,1：免税，2：不征税 3:普通零税率",
    "115048" => "增值税特殊管理长度有误，最大长度为 50 位",
    "115049" => "项目名称为空",
    "115050" => "项目名称长度有误，最大长度为 200 位",
    "115051" => "规格型号长度有误，最大长度为 200 位",
    "115052" => "单位长度有误，最大长度为 100 位",
    "115053" => "项目数量长度有误，最大长度为 20 位",
    "115054" => "项目单价长度有误，最大长度为 20 位",
    "115055" => "项目金额不合法，需等于单价乘以数量的值",
    "115056" => "项目金额不合法，不能为 0",
    "115057" => "含税标志为空",
    "115058" => "含税标志不合法，红字发票申请表上传申请时此项不能为 1",
    "115059" => "税率为空",
    "115060" => "税率不合法，需精确到小数点后 2 位",
    "115061" => "税额不合法，需精确到小数点后 2 位",
    "115062" => "合计金额 HJJE 不合法，必须为负数",
    "115063" => "合计税额 HJSE 不合法，必须为负数",
    "115064" => "YHZCBS 为 1, 且税率为 0, 则 LSLBS 只能根据实际情况选择 0 或 1 或 2 中的一种, 不能选择 3, 且 ZZSTSGL 内容也只能写与 0/1/2 对应的出口零税/免税/不征税",
    "115065" => "如果税率为 0,但并不属于优惠政策(即普通的零税率),则 YHZCBS 填 0,LSLBS 填3,ZZSTSGL 为空",
    "115066" => "如果税率不为 0,  但属于优惠政策,则 YHZCBS 填 1,LSLBS 填空或不填,ZZSTSGL 根据实际情况填写",
    "115067" => "如果税率不为 0, 且不属于优惠政策, 则 YHZCBS 填 0,LSLBS 填空或不填,ZZSTSGL 不填或空",
    "115068" => "如果 YHZCBS 为 0,ZZSTSGL 不填",
    "115069" => "受理点为空",
    "115070" => "受理点长度有误，最大长度为 8 位",
    "115071" => "申请单明细最多支持 8 行，超过 8 行需按照清单红字格式申请",
    "115072" => "发票行性质有误",
    "115073" => "清单红字申请单明细行数限制为 1 行",
    "115074" => "优惠政策标识有误",
    "115075" => "清单红字申请单规格型号、计量单位、项目数量、项目单价填充为空",
    "215001" => "红字发票申请表上传申请,销方申请,原蓝字发票不存在！",
    "216001" => "申请表上传状态查询，请求批次号不存在",
    "060111" => "红字发票申请表正在处理中！",
    "060000" => "红字发票申请表全部审核成功！",
    "060001" => "红字发票申请表部分审核成功！",
    "060002" => "红字发票申请表全部审核不通过！",
    "DX00000" => "红字发票申请表等待申请中!",
    "TZD0000" => "红字发票申请表审核成功!",
    "TZD1000" => "红字发票申请表审核成功!",
    "TZD0100" => "蓝字发票有认证记录, 不允许开具信息表!",
    "TZD0071" => "红字发票申请表待查证!",

    //红票申请表审核结果下载（增专专用）
    "117001" => "申请表审核结果下载请求批次号重复",
    "117002" => "申请表审核结果下载请求批次号为空",
    "117003" => "申请表审核结果下载请求批次号长度不合法，长度最大为 40 ",
    "117004" => "纳税人名称为空",
    "117005" => "开票机号为空",
    "117006" => "发票类型为空",
    "117007" => "发票类别为空",
    "117008" => "红字发票申请表审核结果下载申请,发票类别不能为 1",
    "117009" => "逾期状态为空",
    "1170010" => "填开日期起可以为空，若填写，格式须为 YYYYMMDD",
    "1170011" => "填开日期止可以为空，若填写，格式须为 YYYYMMDD",
    "1170012" => "购买方税号不合法",
    "1170013" => "销售方税号不合法",
    "1170014" => "信息表编号长度不合法, 最大为 16 位",
    "1170015" => "信息表下载范围为空",
    "1170016" => "信息表下载范围数值不合法, 只能为 0 或 1 或 2",
//    "060111" => "申请表审核结果下载正在下载中",
//    "060000" => "申请表审核结果下载下载成功!",
//    "060002" => "申请表审核结果下载下载失败!",
    "217001" => "申请表审核结果下载状态查询，请求批次号不存在",

];